The plan is saved for 59d7a218b54f360571a7a6fe2edd95f0c0b7401f.
Use `/apply` to apply the plan and merge this PR.
<details><summary>Show output</summary>

```
warning: file 'nixpkgs' was not found in the Nix search path (add it using $NIX_PATH or -I), at (string):1:9; will use bash from your environment
module.staging.module.database.sakuracloud_disk.data_disk: Refreshing state... [id=113300794882]
sakuracloud_internet.router: Refreshing state... [id=113300794884]
module.staging.module.database.sakuracloud_packet_filter.switch: Refreshing state... [id=113300794886]
module.staging.module.minio.sakuracloud_packet_filter.switch: Refreshing state... [id=113300794887]
module.staging.sakuracloud_switch.internal: Refreshing state... [id=113300794881]
module.staging.module.nightly.sakuracloud_packet_filter.external: Refreshing state... [id=113300794889]
cloudflare_record.beta_direct: Refreshing state... [id=1b54f963411a2acacec555596c983d16]
cloudflare_record.nightly_direct: Refreshing state... [id=90db917eef1634f79079b6088e7a79cd]
module.staging.module.beta.sakuracloud_packet_filter.external: Refreshing state... [id=113300794888]
module.staging.module.minio.sakuracloud_disk.data_disk: Refreshing state... [id=113300794883]
module.staging.module.minio.random_password.access_key: Refreshing state... [id=none]
module.staging.module.minio.random_password.secret_key: Refreshing state... [id=none]
module.staging.module.database.random_password.password: Refreshing state... [id=none]
module.staging.module.database.random_password.username: Refreshing state... [id=none]
cloudflare_record.nightly: Refreshing state... [id=2e41328cc8796ffbfa6cf733482047cd]
cloudflare_record.beta: Refreshing state... [id=9d7bab4cf861b1f702049a336b5ed343]
module.staging.module.minio.module.nixos_minio.sakuracloud_archive.nixos: Refreshing state... [id=113300794895]
module.staging.module.minio.sakuracloud_disk.disk: Refreshing state... [id=113300794911]
module.staging.module.minio.sakuracloud_server.minio: Refreshing state... [id=113300794913]
module.staging.module.database.module.nixos_database.sakuracloud_archive.nixos: Refreshing state... [id=113300794897]
module.staging.module.database.sakuracloud_disk.disk: Refreshing state... [id=113300794917]
module.staging.module.database.sakuracloud_server.database: Refreshing state... [id=113300794920]
module.staging.module.nightly.module.nixos_archive.sakuracloud_archive.nixos: Refreshing state... [id=113300794903]
module.staging.module.nightly.sakuracloud_disk.server_disk: Refreshing state... [id=113300794925]
module.staging.module.beta.module.nixos_archive.sakuracloud_archive.nixos: Refreshing state... [id=113300794907]
module.staging.module.beta.sakuracloud_disk.server_disk: Refreshing state... [id=113300794927]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.beta must be replaced
-/+ resource "cloudflare_record" "beta" {
      ~ created_on  = "2021-04-20T09:35:37.867241Z" -> (known after apply)
      - data        = {} -> null
      ~ hostname    = "online-api-beta.sohosai.com" -> (known after apply)
      ~ id          = "9d7bab4cf861b1f702049a336b5ed343" -> (known after apply)
      ~ metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on = "2021-04-20T09:35:37.867241Z" -> (known after apply)
      ~ name        = "online-api-beta" -> "api.beta.online" # forces replacement
      - priority    = 0 -> null
      ~ proxiable   = true -> (known after apply)
      ~ proxied     = true -> false
        # (4 unchanged attributes hidden)
    }

  # cloudflare_record.beta_direct will be destroyed
  - resource "cloudflare_record" "beta_direct" {
      - created_on  = "2021-04-20T09:35:37.429648Z" -> null
      - data        = {} -> null
      - hostname    = "direct.online-api-beta.sohosai.com" -> null
      - id          = "1b54f963411a2acacec555596c983d16" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on = "2021-04-20T09:35:37.429648Z" -> null
      - name        = "direct.online-api-beta" -> null
      - priority    = 0 -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - value       = "153.120.137.21" -> null
      - zone_id     = "473405a99e276061eee7da4bef87aa3e" -> null
    }

  # cloudflare_record.nightly must be replaced
-/+ resource "cloudflare_record" "nightly" {
      ~ created_on  = "2021-04-20T09:35:38.110872Z" -> (known after apply)
      - data        = {} -> null
      ~ hostname    = "online-api-nightly.sohosai.com" -> (known after apply)
      ~ id          = "2e41328cc8796ffbfa6cf733482047cd" -> (known after apply)
      ~ metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on = "2021-04-20T09:35:38.110872Z" -> (known after apply)
      ~ name        = "online-api-nightly" -> "api.nightly.online" # forces replacement
      - priority    = 0 -> null
      ~ proxiable   = true -> (known after apply)
      ~ proxied     = true -> false
        # (4 unchanged attributes hidden)
    }

  # cloudflare_record.nightly_direct will be destroyed
  - resource "cloudflare_record" "nightly_direct" {
      - created_on  = "2021-04-20T09:35:37.671809Z" -> null
      - data        = {} -> null
      - hostname    = "direct.online-api-nightly.sohosai.com" -> null
      - id          = "90db917eef1634f79079b6088e7a79cd" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on = "2021-04-20T09:35:37.671809Z" -> null
      - name        = "direct.online-api-nightly" -> null
      - priority    = 0 -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - value       = "153.120.137.20" -> null
      - zone_id     = "473405a99e276061eee7da4bef87aa3e" -> null
    }

  # module.staging.module.beta.sakuracloud_disk.server_disk must be replaced
-/+ resource "sakuracloud_disk" "server_disk" {
      ~ id                = "113300794927" -> (known after apply)
        name              = "sos21_staging_server_disk"
      + server_id         = (known after apply)
      ~ source_archive_id = "113300794907" -> (known after apply) # forces replacement
        tags              = [
            "sos21_beta",
            "sos21_server_disk",
            "sos21_staging",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.staging.module.beta.sakuracloud_packet_filter.external will be updated in-place
  ~ resource "sakuracloud_packet_filter" "external" {
        id   = "113300794888"
        name = "sos21_staging_server_external"
        # (1 unchanged attribute hidden)

      ~ expression {
          ~ destination_port = "22" -> "443"
            # (2 unchanged attributes hidden)
        }
      ~ expression {
          ~ destination_port = "32768-61000" -> "22"
            # (2 unchanged attributes hidden)
        }
      ~ expression {
          ~ protocol         = "udp" -> "tcp"
            # (2 unchanged attributes hidden)
        }
      ~ expression {
          + destination_port = "32768-61000"
          ~ protocol         = "icmp" -> "udp"
            # (1 unchanged attribute hidden)
        }
      ~ expression {
          ~ protocol = "fragment" -> "icmp"
            # (1 unchanged attribute hidden)
        }
      ~ expression {
          ~ allow    = false -> true
          ~ protocol = "ip" -> "fragment"
        }
      + expression {
          + allow    = false
          + protocol = "ip"
        }
        # (1 unchanged block hidden)
    }

  # module.staging.module.beta.sakuracloud_server.server will be created
  + resource "sakuracloud_server" "server" {
      + commitment        = "standard"
      + core              = 2
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 2
      + name              = "sos21_staging_server"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_beta",
          + "sos21_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = "113300794888"
          + upstream         = "113300794885"
          + user_ip_address  = "153.120.137.21"
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113300794881"
          + user_ip_address = "192.168.0.13"
        }
    }

  # module.staging.module.nightly.sakuracloud_disk.server_disk must be replaced
-/+ resource "sakuracloud_disk" "server_disk" {
      ~ id                = "113300794925" -> (known after apply)
        name              = "sos21_staging_server_disk"
      + server_id         = (known after apply)
      ~ source_archive_id = "113300794903" -> (known after apply) # forces replacement
        tags              = [
            "sos21_nightly",
            "sos21_server_disk",
            "sos21_staging",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.staging.module.nightly.sakuracloud_packet_filter.external will be updated in-place
  ~ resource "sakuracloud_packet_filter" "external" {
        id   = "113300794889"
        name = "sos21_staging_server_external"
        # (1 unchanged attribute hidden)

      ~ expression {
          ~ destination_port = "22" -> "443"
            # (2 unchanged attributes hidden)
        }
      ~ expression {
          ~ destination_port = "32768-61000" -> "22"
            # (2 unchanged attributes hidden)
        }
      ~ expression {
          ~ protocol         = "udp" -> "tcp"
            # (2 unchanged attributes hidden)
        }
      ~ expression {
          + destination_port = "32768-61000"
          ~ protocol         = "icmp" -> "udp"
            # (1 unchanged attribute hidden)
        }
      ~ expression {
          ~ protocol = "fragment" -> "icmp"
            # (1 unchanged attribute hidden)
        }
      ~ expression {
          ~ allow    = false -> true
          ~ protocol = "ip" -> "fragment"
        }
      + expression {
          + allow    = false
          + protocol = "ip"
        }
        # (1 unchanged block hidden)
    }

  # module.staging.module.nightly.sakuracloud_server.server will be created
  + resource "sakuracloud_server" "server" {
      + commitment        = "standard"
      + core              = 1
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "sos21_staging_server"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_nightly",
          + "sos21_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = "113300794889"
          + upstream         = "113300794885"
          + user_ip_address  = "153.120.137.20"
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113300794881"
          + user_ip_address = "192.168.0.14"
        }
    }

  # module.staging.module.beta.module.nixos_archive.sakuracloud_archive.nixos must be replaced
-/+ resource "sakuracloud_archive" "nixos" {
      ~ archive_file = "modules/sakuracloud_archive_nixos_custom/.built_image/1wadvb7adzl9n9ixvqwdg0admyf2jpaq-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1.img" -> "modules/sakuracloud_archive_nixos_custom/.built_image/88p884gpg80ncz57fndfzp6dj5mk0b21-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1.img" # forces replacement
      ~ description  = "1wadvb7adzl9n9ixvqwdg0admyf2jpaq-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1" -> "88p884gpg80ncz57fndfzp6dj5mk0b21-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1"
      + hash         = (known after apply) # forces replacement
      ~ id           = "113300794907" -> (known after apply)
        name         = "sos21_staging_nixos"
        tags         = [
            "sos21_archive_nixos",
            "sos21_beta",
            "sos21_staging",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.staging.module.nightly.module.nixos_archive.sakuracloud_archive.nixos must be replaced
-/+ resource "sakuracloud_archive" "nixos" {
      ~ archive_file = "modules/sakuracloud_archive_nixos_custom/.built_image/w8kcw23lbwsd761gd66rgi058w25qh5q-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1.img" -> "modules/sakuracloud_archive_nixos_custom/.built_image/ls16a8kj0lcy2zi412875jraljm632xy-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1.img" # forces replacement
      ~ description  = "w8kcw23lbwsd761gd66rgi058w25qh5q-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1" -> "ls16a8kj0lcy2zi412875jraljm632xy-sakuracloud-server-image-d3ea7cd5d75eee14fed2d4ba1c02afc96079852784dbfd00b9a67956daca33c1"
      + hash         = (known after apply) # forces replacement
      ~ id           = "113300794903" -> (known after apply)
        name         = "sos21_staging_nixos"
        tags         = [
            "sos21_archive_nixos",
            "sos21_nightly",
            "sos21_staging",
        ]
        # (2 unchanged attributes hidden)
    }

Plan: 8 to add, 2 to change, 8 to destroy.
```
</details>